examples/docs/xml_exemplo/consultarNfse_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ConsultarNfse xmlns="http://www.e-governeapps2.com.br/">
      <ConsultarNfseEnvio>
        <Prestador>
          <Cnpj>string</Cnpj>
          <InscricaoMunicipal>string</InscricaoMunicipal>
        </Prestador>
        <NumeroNfse>unsignedLong</NumeroNfse>
        <PeriodoEmissao>
          <DataInicial>dateTime</DataInicial>
          <DataFinal>dateTime</DataFinal>
        </PeriodoEmissao>
        <Tomador>
          <CpfCnpj>
            <Cpf>string</Cpf>
            <Cnpj>string</Cnpj>
          </CpfCnpj>
          <InscricaoMunicipal>string</InscricaoMunicipal>
        </Tomador>
        <IntermediarioServico>
          <RazaoSocial>string</RazaoSocial>
          <CpfCnpj>
            <Cpf>string</Cpf>
            <Cnpj>string</Cnpj>
          </CpfCnpj>
          <InscricaoMunicipal>string</InscricaoMunicipal>
        </IntermediarioServico>
      </ConsultarNfseEnvio>
    </ConsultarNfse>
  </soap:Body>
</soap:Envelope>